Repository: dxpr/ckeditor5-ai-agent
Catalog: lang/translations/*.po
Languages: es, hi, nl

source: Network Authentication Required. The client needs to authenticate to gain network access.
es: Se requiere autenticación de red. El cliente debe autenticarse para obtener acceso a la red.
hi: नेटवर्क प्रमाणीकरण आवश्यक। क्लाइंट को नेटवर्क एक्सेस प्राप्त करने के लिए प्रमाणीकरण करना आवश्यक है।
nl: Netwerkverificatie vereist. De client moet zich authenticeren om toegang te krijgen tot het netwerk.

source: Edit or review
es: Editar o revisar
hi: संपादित करें या समीक्षा करें
nl: Bewerken of beoordelen

source: Improve Writing
es: Mejorar la escritura
hi: लेखन में सुधार करें
nl: Schrijven verbeteren

source: Make Shorter
es: Hacer más corto
hi: छोटा करें
nl: Maak korter

source: Make Longer
es: Hacer más largo
hi: लंबा करें
nl: Maak langer

source: Simplify Language
es: Simplificar el lenguaje
hi: भाषा को सरल बनाएं
nl: Vereenvoudig taal

source: Generate from selection
es: Generar desde la selección
hi: चयन से उत्पन्न करें
nl: Genereren uit selectie

source: Summarize
es: Resumir
hi: सारांशित करें
nl: Samenvatten

source: Continue
es: Continuar
hi: जारी रखें
nl: Doorgaan

source: Style & Tone
es: Estilo y tono
hi: शैली और स्वर
nl: Stijl en toon

source: Make Professional
es: Hacer profesional
hi: पेशेवर बनाएं
nl: Maak professioneel

source: Make Casual
es: Hacer informal
hi: आम बनाएं
nl: Maak informeel

source: Make Technical
es: Hacer técnico
hi: तकनीकी बनाएं
nl: Maak technisch

source: Enhance Content
es: Mejorar el contenido
hi: सामग्री को बेहतर बनाएं
nl: Inhoud verbeteren

source: Add Examples
es: Añadir ejemplos
hi: उदाहरण जोड़ें
nl: Voorbeelden toevoegen

source: Add Statistics
es: Añadir estadísticas
hi: सांख्यिकी जोड़ें
nl: Statistieken toevoegen

source: Expand Details
es: Expandir detalles
hi: विवरण बढ़ाएं
nl: Details uitbreiden

source: Length required. The server requires a Content-Length header to be included in the request.
hi: लंबाई आवश्यक है। सर्वर को अनुरोध में एक Content-Length हेडर शामिल करने की आवश्यकता है।
nl: Lengte vereist. De server vereist dat een Content-Length-header in het verzoek wordt opgenomen.

source: Precondition failed. One or more conditions specified in the request headers evaluated to false when tested on the server.
hi: पूर्व शर्त विफल हो गई। अनुरोध हेडर में निर्दिष्ट एक या अधिक शर्तें सर्वर पर परीक्षण के दौरान गलत पाई गईं।
nl: Voorwaarde mislukt. Een of meer voorwaarden die in de verzoekheaders zijn gespecificeerd, werden als onwaar beoordeeld bij het testen op de server.

source: Payload too large. The server refuses to process the request because the payload is larger than the server is willing or able to process.
hi: पेलोड बहुत बड़ा है। सर्वर अनुरोध को संसाधित करने से इनकार करता है क्योंकि पेलोड सर्वर की क्षमता से बड़ा है।
nl: Lading te groot. De server weigert het verzoek te verwerken omdat de lading groter is dan de server bereid of in staat is te verwerken.

source: URI too long. The server refuses to process the request because the URI is longer than the server is willing to interpret.
hi: URI बहुत लंबा है। सर्वर अनुरोध को संसाधित करने से इनकार करता है क्योंकि URI सर्वर की व्याख्या क्षमता से बड़ा है।
nl: URI te lang. De server weigert het verzoek te verwerken omdat de URI langer is dan de server wil interpreteren.

source: Unsupported media type. The server refuses to process the request because the media type is not supported.
hi: असमर्थित मीडिया प्रकार। सर्वर अनुरोध को संसाधित करने से इनकार करता है क्योंकि मीडिया प्रकार समर्थित नहीं है।
nl: Niet-ondersteund mediatype. De server weigert het verzoek te verwerken omdat het mediatype niet wordt ondersteund.

source: Range not satisfiable. The server cannot fulfill the request because the client has asked for a portion of the file that cannot be provided.
hi: रेंज संतोषजनक नहीं है। सर्वर अनुरोध को पूरा नहीं कर सकता क्योंकि क्लाइंट ने फ़ाइल के उस हिस्से का अनुरोध किया है जिसे प्रदान नहीं किया जा सकता।
nl: Bereik niet bevredigend. De server kan het verzoek niet inwilligen omdat de client om een deel van het bestand heeft gevraagd dat niet kan worden geleverd.

source: Expectation failed. The server is unable to meet the requirements specified by the Expect request header field.
hi: अपेक्षा विफल हो गई। सर्वर 'Expect' अनुरोध हेडर फ़ील्ड द्वारा निर्दिष्ट आवश्यकताओं को पूरा करने में असमर्थ है।
nl: Verwachting mislukt. De server kan niet voldoen aan de vereisten die zijn gespecificeerd in het veld Expect-verzoekheader.

source: I'm a teapot. The server refuses to brew coffee because it is, permanently and intentionally, a teapot.
hi: मैं एक टीपॉट हूं। सर्वर कॉफी बनाने से इनकार करता है क्योंकि यह स्थायी रूप से और जानबूझकर एक टीपॉट है।
nl: Ik ben een theepot. De server weigert koffie te zetten omdat het permanent en opzettelijk een theepot is.

source: Misdirected request. The request was directed at a server that is not able to produce a response.
hi: ग़लत दिशा में अनुरोध। अनुरोध को ऐसे सर्वर पर निर्देशित किया गया था जो प्रतिक्रिया उत्पन्न करने में सक्षम नहीं है।
nl: Verkeerd gericht verzoek. Het verzoek was gericht aan een server die niet in staat is een reactie te geven.

source: Unprocessable entity. The server understands the content type of the request entity but cannot process the contained instructions.
hi: अप्रक्रियनीय इकाई। सर्वर अनुरोध इकाई के सामग्री प्रकार को समझता है, लेकिन इसमें शामिल निर्देशों को संसाधित नहीं कर सकता।
nl: Niet-verwerkbare entiteit. De server begrijpt het inhoudstype van de verzoekentiteit, maar kan de daarin opgenomen instructies niet verwerken.

source: Locked. The requested resource is locked and can only be accessed by the client that locked it.
hi: लॉक किया गया। अनुरोधित संसाधन लॉक कर दिया गया है और केवल उसी क्लाइंट द्वारा एक्सेस किया जा सकता है जिसने इसे लॉक किया है।
nl: Vergrendeld. De gevraagde bron is vergrendeld en kan alleen worden geopend door de client die het heeft vergrendeld.

source: Failed dependency. The request failed because it depended on another request and that request failed.
hi: असफल निर्भरता। अनुरोध विफल हो गया क्योंकि यह किसी अन्य अनुरोध पर निर्भर था और वह अनुरोध विफल हो गया।
nl: Afhankelijke fout. Het verzoek is mislukt omdat het afhankelijk was van een ander verzoek en dat verzoek is mislukt.

source: Too early. The server is unwilling to risk processing a request that might be replayed.
hi: बहुत जल्दी। सर्वर उस अनुरोध को संसाधित करने का जोखिम उठाने के लिए तैयार नहीं है जिसे पुनः चलाया जा सकता है।
nl: Te vroeg. De server is niet bereid het risico te nemen om een verzoek te verwerken dat mogelijk opnieuw wordt afgespeeld.

source: Upgrade required. The client should switch to a different protocol.
hi: अपग्रेड आवश्यक। क्लाइंट को किसी भिन्न प्रोटोकॉल पर स्विच करना चाहिए।
nl: Upgrade vereist. De client moet overschakelen naar een ander protocol.

source: Precondition required. The origin server requires the request to be conditional.
hi: पूर्व शर्त आवश्यक। ओरिजिन सर्वर को अनुरोध के सशर्त होने की आवश्यकता है।
nl: Voorwaarde vereist. De oorspronkelijke server vereist dat het verzoek voorwaardelijk is.

source: Too many requests. The user has sent too many requests in a given amount of time.
hi: बहुत अधिक अनुरोध। उपयोगकर्ता ने दिए गए समय में बहुत अधिक अनुरोध भेजे हैं।
nl: Te veel verzoeken. De gebruiker heeft te veel verzoeken verzonden in een bepaalde periode.

source: Request header fields too large. The server is unwilling to process the request because its header fields are too large.
hi: अनुरोध हेडर फ़ील्ड बहुत बड़े हैं। सर्वर अनुरोध को संसाधित करने से इनकार करता है क्योंकि इसके हेडर फ़ील्ड बहुत बड़े हैं।
nl: Verzoekheader-velden te groot. De server weigert het verzoek te verwerken omdat de header-velden te groot zijn.

source: Unavailable for legal reasons. The server is denying access to the resource as a consequence of a legal demand.
hi: कानूनी कारणों से अनुपलब्ध। सर्वर कानूनी मांग के परिणामस्वरूप संसाधन तक पहुंच को अस्वीकार कर रहा है।
nl: Niet beschikbaar om juridische redenen. De server weigert toegang tot de bron als gevolg van een juridische eis.

source: Internal Server Error. The server encountered an unexpected condition that prevented it from fulfilling the request.
hi: आंतरिक सर्वर त्रुटि। सर्वर को एक अप्रत्याशित स्थिति का सामना करना पड़ा जिसने उसे अनुरोध को पूरा करने से रोका।
nl: Interne serverfout. De server heeft een onverwachte toestand ondervonden die het onmogelijk maakte om het verzoek in te willigen.

source: Not Implemented. The server does not support the functionality required to fulfill the request.
hi: अमल में नहीं लाया गया। सर्वर उस कार्यक्षमता का समर्थन नहीं करता जो अनुरोध को पूरा करने के लिए आवश्यक है।
nl: Niet ge√Ømplementeerd. De server ondersteunt de functionaliteit die vereist is om het verzoek te voltooien niet.
