Repository: dxpr/ckeditor5-ai-agent
Catalog: lang/translations/*.po
Languages: es, hi, nl

source: AI Agent
es: Agente de IA
hi: एआई एजेंट

# Hint suggesting users utilize AI for documenting or content creation.
source: Type / to request AI content
es: Escriba / para solicitar contenido de IA
hi: / टाइप करें एआई सामग्री का अनुरोध करने के लिए
nl: Typ / om AI-inhoud aan te vragen

# Appears when the Browser does not support readable streams.
source: Browser does not support readable streams
es: El navegador no admite flujos legibles
hi: ब्राउज़र पठनीय स्ट्रीम का समर्थन नहीं करता है
nl: Browser ondersteunt geen leesbare streams

# Indicates a failure during a network call.
source: We couldn't connect to the AI. Please check your internet
es: No pudimos conectarnos a la IA. Por favor, verifique su conexión a Internet
hi: हम एआई से कनेक्ट नहीं हो सके। कृपया अपना इंटरनेट जांचें
nl: We konden geen verbinding maken met de AI. Controleer uw internetverbinding

# Appears when an unsupported language code is provided.
source: Unsupported language code
es: Código de idioma no compatible
hi: असमर्थित भाषा कोड
nl: Niet-ondersteunde taalcode

source: Invalid moderation response format
es: Formato de respuesta de moderación no válido
hi: अमान्य मॉडरेशन प्रतिक्रिया प्रारूप
nl: Ongeldig moderatie-antwoordformaat

source: I'm sorry, but I cannot assist with that request.
es: Lo siento, pero no puedo ayudar con esa solicitud.
hi: मुझे खेद है, लेकिन मैं उस अनुरोध में सहायता नहीं कर सकता।
nl: Het spijt me, maar ik kan niet helpen met dat verzoek.

source: Cancel Generation
es: Cancelar Generación
hi: जनरेशन रद्द करें
nl: Generatie annuleren

source: Insert slash command (AI Agent)
es: Insertar comando de barra (Agente de IA)
hi: स्लैश कमांड डालें (एआई एजेंट)
nl: Voeg schuine-streep-commando in (AI-agent)

source: Cancel AI Generation
es: Cancelar Generación de IA
hi: एआई जनरेशन रद्द करें
nl: AI-generatie annuleren

source: Search AI command
es: Buscar comando de IA
hi: एआई कमांड खोजें
nl: Zoek AI-commando

source: Continue: The server has received the request headers and the client should proceed to send the request body.
es: Continuar: El servidor ha recibido los encabezados de la solicitud y el cliente debe proceder a enviar el cuerpo de la solicitud.
hi: जारी रखें: सर्वर ने अनुरोध हेडर प्राप्त कर लिया है और क्लाइंट को अनुरोध बॉडी भेजनी चाहिए।
nl: Doorgaan: De server heeft de aanvraagheaders ontvangen en de client moet doorgaan met het verzenden van de aanvraaginhoud.

source: Switching Protocols: The server is switching protocols according to the Upgrade header.
es: Cambiando Protocolos: El servidor está cambiando los protocolos de acuerdo con el encabezado de actualización.
hi: प्रोटोकॉल बदलना: सर्वर अपग्रेड हेडर के अनुसार प्रोटोकॉल बदल रहा है।
nl: Wisselen van protocollen: De server wisselt van protocollen volgens de Upgrade-header.

source: Processing: The server has received and is processing the request, but no response is available yet.
es: Procesando: El servidor ha recibido y está procesando la solicitud, pero aún no hay respuesta disponible.
hi: प्रोसेसिंग: सर्वर ने अनुरोध प्राप्त कर लिया है और इसे संसाधित कर रहा है, लेकिन अभी कोई प्रतिक्रिया उपलब्ध नहीं है।
nl: Verwerken: De server heeft het verzoek ontvangen en is het aan het verwerken, maar er is nog geen antwoord beschikbaar.

source: Early Hints: Used to return some response headers before final HTTP message.
es: Sugerencias Tempranas: Se utiliza para devolver algunos encabezados de respuesta antes del mensaje HTTP final.
hi: प्रारंभिक संकेत: अंतिम HTTP संदेश से पहले कुछ प्रतिक्रिया हेडर लौटाने के लिए उपयोग किया जाता है।
nl: Vroege hints: Wordt gebruikt om enkele antwoordheaders terug te sturen voordat het definitieve HTTP-bericht wordt verzonden.

source: The request has succeeded.
es: La solicitud ha tenido éxito.
hi: अनुरोध सफल रहा।
nl: Het verzoek is geslaagd.

source: The request has been fulfilled and resulted in a new resource being created.
es: La solicitud se ha cumplido y ha resultado en la creación de un nuevo recurso.
hi: अनुरोध पूरा हो गया है और एक नया संसाधन बनाया गया है।
nl: Het verzoek is uitgevoerd en heeft geresulteerd in het aanmaken van een nieuwe bron.

source: The request has been accepted for processing, but the processing has not been completed.
es: La solicitud ha sido aceptada para su procesamiento, pero el procesamiento no se ha completado.
hi: प्रसंस्करण के लिए अनुरोध स्वीकार कर लिया गया है, लेकिन प्रसंस्करण पूरा नहीं हुआ है।
nl: Het verzoek is geaccepteerd voor verwerking, maar de verwerking is nog niet voltooid.

source: The server successfully processed the request, but is returning information from another source.
es: El servidor procesó la solicitud con éxito, pero está devolviendo información de otra fuente.
hi: सर्वर ने अनुरोध को सफलतापूर्वक संसाधित कर दिया है, लेकिन यह किसी अन्य स्रोत से जानकारी लौटा रहा है।
nl: De server heeft het verzoek met succes verwerkt, maar geeft informatie terug van een andere bron.

source: The server successfully processed the request, but is not returning any content.
es: El servidor procesó la solicitud con éxito, pero no está devolviendo ningún contenido.
hi: सर्वर ने अनुरोध को सफलतापूर्वक संसाधित कर दिया है, लेकिन कोई भी सामग्री वापस नहीं कर रहा है।
nl: De server heeft het verzoek met succes verwerkt, maar geeft geen inhoud terug.

source: The server successfully processed the request, but is not returning any content. The user agent should reset the document view.
es: El servidor procesó la solicitud con éxito, pero no está devolviendo ningún contenido. El agente de usuario debe restablecer la vista del documento.
hi: सर्वर ने अनुरोध को सफलतापूर्वक संसाधित कर दिया है, लेकिन कोई भी सामग्री वापस नहीं कर रहा है। उपयोगकर्ता एजेंट को दस्तावेज़ दृश्य को रीसेट करना चाहिए।
nl: De server heeft het verzoek met succes verwerkt, maar geeft geen inhoud terug. De gebruikersagent moet de documentweergave opnieuw instellen.

source: The server has fulfilled the partial GET request for the resource.
es: El servidor ha cumplido con la solicitud GET parcial para el recurso.
hi: सर्वर ने संसाधन के लिए आंशिक GET अनुरोध को पूरा कर दिया है।
nl: De server heeft het gedeeltelijke GET-verzoek voor de bron uitgevoerd.

source: The response from the server contains multiple status codes, each with its own set of headers and body.
es: La respuesta del servidor contiene múltiples códigos de estado, cada uno con su propio conjunto de encabezados y cuerpo.
hi: सर्वर की प्रतिक्रिया में कई स्थिति कोड होते हैं, जिनमें से प्रत्येक का अपना हेडर और बॉडी होता है।
nl: De reactie van de server bevat meerdere statuscodes, elk met zijn eigen set headers en inhoud.

source: The server has encountered a previous condition and is applying it to this current request.
es: El servidor ha encontrado una condición previa y la está aplicando a esta solicitud actual.
hi: सर्वर ने एक पूर्व स्थिति का सामना किया है और इसे वर्तमान अनुरोध पर लागू कर रहा है।
nl: De server heeft een eerdere voorwaarde ondervonden en past deze toe op dit huidige verzoek.

source: The server has fulfilled a GET request for the resource, and the response is a representation of the result of one or more instance-manipulations applied to the current instance.
es: El servidor ha cumplido con una solicitud GET para el recurso, y la respuesta es una representación del resultado de una o más manipulaciones de la instancia aplicadas a la instancia actual.
hi: सर्वर ने संसाधन के लिए GET अनुरोध को पूरा कर दिया है, और प्रतिक्रिया उस परिणाम का प्रतिनिधित्व करती है जो एक या अधिक उदाहरण हेरफेर लागू करने के बाद आया है।
nl: De server heeft een GET-verzoek voor de bron voltooid, en de reactie is een weergave van het resultaat van een of meer instantie-manipulaties die zijn toegepast op de huidige instantie.

source: The server has multiple options for the requested resource.
es: El servidor tiene múltiples opciones para el recurso solicitado.
hi: सर्वर के पास अनुरोधित संसाधन के लिए कई विकल्प हैं।
nl: De server heeft meerdere opties voor de opgevraagde bron.

source: The requested resource has been permanently moved to a new location.
es: El recurso solicitado se ha movido permanentemente a una nueva ubicación.
hi: अनुरोधित संसाधन को स्थायी रूप से एक नए स्थान पर स्थानांतरित कर दिया गया है।
nl: De opgevraagde bron is permanent verplaatst naar een nieuwe locatie.

source: The requested resource has been found, but it has been temporarily moved to a different location.
es: El recurso solicitado ha sido encontrado, pero se ha movido temporalmente a una ubicación diferente.
hi: अनुरोधित संसाधन पाया गया है, लेकिन इसे अस्थायी रूप से किसी अन्य स्थान पर स्थानांतरित कर दिया गया है।
nl: De opgevraagde bron is gevonden, maar is tijdelijk verplaatst naar een andere locatie.

source: The response to the request can be found under a different URI and should be retrieved using a GET method on that resource.
es: La respuesta a la solicitud se puede encontrar bajo un URI diferente y debe recuperarse usando un método GET en ese recurso.
hi: अनुरोध के लिए प्रतिक्रिया किसी भिन्न URI के तहत पाई जा सकती है और उस संसाधन पर GET विधि का उपयोग करके पुनः प्राप्त की जानी चाहिए।
nl: De reactie op het verzoek is te vinden onder een andere URI en moet worden opgehaald met een GET-methode voor die bron.

source: The requested resource has not been modified since the last request. It is still valid from the server's cache.
es: El recurso solicitado no ha sido modificado desde la última solicitud. Todavía es válido desde la caché del servidor.
hi: पिछले अनुरोध के बाद से अनुरोधित संसाधन में कोई संशोधन नहीं किया गया है। यह अभी भी सर्वर की कैश से मान्य है।
nl: De opgevraagde bron is sinds het laatste verzoek niet gewijzigd. Het is nog steeds geldig vanuit de cache van de server.

source: The requested resource must be accessed through the proxy given by the Location field.
es: El recurso solicitado debe accederse a través del proxy proporcionado por el campo de ubicación.
hi: अनुरोधित संसाधन तक पहुंचने के लिए लोकेशन फ़ील्ड द्वारा दिए गए प्रॉक्सी के माध्यम से जाना आवश्यक है।
nl: De opgevraagde bron moet worden benaderd via de proxy die wordt opgegeven in het locatieveld.

source: The requested resource has been temporarily moved to a different location, and the client should continue to use the same method for future requests.
es: El recurso solicitado se ha movido temporalmente a una ubicación diferente, y el cliente debe continuar usando el mismo método para futuras solicitudes.
hi: अनुरोधित संसाधन को अस्थायी रूप से किसी अन्य स्थान पर स्थानांतरित कर दिया गया है, और ग्राहक को भविष्य के अनुरोधों के लिए उसी विधि का उपयोग जारी रखना चाहिए।
nl: De opgevraagde bron is tijdelijk verplaatst naar een andere locatie, en de client moet dezelfde methode blijven gebruiken voor toekomstige verzoeken.

source: The requested resource has been permanently moved to a different location, and the client should use the new URI for all future requests.
es: El recurso solicitado se ha movido permanentemente a una ubicación diferente, y el cliente debe usar el nuevo URI para todas las solicitudes futuras.
hi: अनुरोधित संसाधन को स्थायी रूप से किसी अन्य स्थान पर स्थानांतरित कर दिया गया है, और ग्राहक को भविष्य के सभी अनुरोधों के लिए नए URI का उपयोग करना चाहिए।
nl: De opgevraagde bron is permanent verplaatst naar een andere locatie, en de client moet de nieuwe URI gebruiken voor alle toekomstige verzoeken.

source: The server could not understand the request due to invalid syntax.
es: El servidor no pudo entender la solicitud debido a una sintaxis no válida.
hi: अमान्य सिंटैक्स के कारण सर्वर अनुरोध को समझ नहीं सका।
nl: De server kon het verzoek niet begrijpen vanwege ongeldige syntaxis.

source: The request requires user authentication.
es: La solicitud requiere autenticación de usuario.
hi: अनुरोध के लिए उपयोगकर्ता प्रमाणीकरण की आवश्यकता होती है।
nl: Het verzoek vereist gebruikersauthenticatie.

source: Payment is required to fulfill the request.
es: Se requiere pago para completar la solicitud.
hi: अनुरोध को पूरा करने के लिए भुगतान की आवश्यकता है।
nl: Betaling is vereist om het verzoek te voltooien.

source: Access to the requested resource is forbidden.
es: El acceso al recurso solicitado está prohibido.
hi: अनुरोधित संसाधन तक पहुंच निषिद्ध है।
nl: Toegang tot de opgevraagde bron is verboden.

source: The server could not find the requested resource.
es: El servidor no pudo encontrar el recurso solicitado.
hi: सर्वर अनुरोधित संसाधन को खोज नहीं सका।
nl: De server kon de opgevraagde bron niet vinden.

source: The request method is not allowed for the requested resource.
es: El método de solicitud no está permitido para el recurso solicitado.
hi: अनुरोधित संसाधन के लिए अनुरोध विधि की अनुमति नहीं है।
nl: De verzoekmethode is niet toegestaan voor de opgevraagde bron.

source: The server cannot generate content that is acceptable according to the Accept headers sent in the request.
es: El servidor no puede generar contenido que sea aceptable de acuerdo con los encabezados de aceptación enviados en la solicitud.
hi: सर्वर अनुरोध में भेजे गए एक्सेप्ट हेडर के अनुसार स्वीकार्य सामग्री उत्पन्न नहीं कर सकता।
nl: De server kan geen inhoud genereren die acceptabel is volgens de Accept-headers die in het verzoek zijn verzonden.

source: Proxy authentication is required to access the requested resource.
es: Se requiere autenticación de proxy para acceder al recurso solicitado.
hi: अनुरोधित संसाधन तक पहुंचने के लिए प्रॉक्सी प्रमाणीकरण की आवश्यकता है।
nl: Proxy-authenticatie is vereist om toegang te krijgen tot de opgevraagde bron.

source: The server timed out waiting for the request.
es: El servidor agotó el tiempo de espera esperando la solicitud.
hi: अनुरोध की प्रतीक्षा करते समय सर्वर का समय समाप्त हो गया।
nl: De server heeft de tijdsduur voor het wachten op het verzoek overschreden.

source: Conflict detected. The request could not be completed due to a conflict with the current state of the resource.
es: Conflicto detectado. La solicitud no se pudo completar debido a un conflicto con el estado actual del recurso.
hi: संघर्ष का पता चला। वर्तमान संसाधन की स्थिति के साथ संघर्ष के कारण अनुरोध पूरा नहीं किया जा सका।
nl: Conflict gedetecteerd. Het verzoek kon niet worden voltooid vanwege een conflict met de huidige status van de bron.

source: Gone. The requested resource is no longer available and will not be available again.
es: Desaparecido. El recurso solicitado ya no está disponible y no estará disponible nuevamente.
hi: चला गया। अनुरोधित संसाधन अब उपलब्ध नहीं है और फिर से उपलब्ध नहीं होगा।
nl: Verdwenen. De opgevraagde bron is niet langer beschikbaar en zal niet opnieuw beschikbaar zijn.

source: Length required. The server requires a Content-Length header to be included in the request.
es: Se requiere longitud. El servidor requiere que se incluya un encabezado Content-Length en la solicitud.

source: Precondition failed. One or more conditions specified in the request headers evaluated to false when tested on the server.
es: Precondición fallida. Una o más condiciones especificadas en los encabezados de la solicitud fueron evaluadas como falsas al ser probadas en el servidor.

source: Payload too large. The server refuses to process the request because the payload is larger than the server is willing or able to process.
es: Carga demasiado grande. El servidor se niega a procesar la solicitud porque la carga es más grande de lo que el servidor está dispuesto o puede procesar.

source: URI too long. The server refuses to process the request because the URI is longer than the server is willing to interpret.
es: URI demasiado largo. El servidor se niega a procesar la solicitud porque el URI es más largo de lo que el servidor está dispuesto a interpretar.

source: Unsupported media type. The server refuses to process the request because the media type is not supported.
es: Tipo de medio no compatible. El servidor se niega a procesar la solicitud porque el tipo de medio no es compatible.

source: Range not satisfiable. The server cannot fulfill the request because the client has asked for a portion of the file that cannot be provided.
es: Rango no satisfactorio. El servidor no puede cumplir con la solicitud porque el cliente ha solicitado una parte del archivo que no se puede proporcionar.

source: Expectation failed. The server is unable to meet the requirements specified by the Expect request header field.
es: Expectativa fallida. El servidor no puede cumplir con los requisitos especificados por el campo de encabezado de solicitud Expect.

source: I'm a teapot. The server refuses to brew coffee because it is, permanently and intentionally, a teapot.
es: Soy una tetera. El servidor se niega a hacer café porque es, de forma permanente e intencional, una tetera.

source: Misdirected request. The request was directed at a server that is not able to produce a response.
es: Solicitud mal dirigida. La solicitud se dirigió a un servidor que no puede producir una respuesta.

source: Unprocessable entity. The server understands the content type of the request entity but cannot process the contained instructions.
es: Entidad no procesable. El servidor entiende el tipo de contenido de la entidad de la solicitud, pero no puede procesar las instrucciones contenidas.

source: Locked. The requested resource is locked and can only be accessed by the client that locked it.
es: Bloqueado. El recurso solicitado está bloqueado y solo puede ser accedido por el cliente que lo bloqueó.

source: Failed dependency. The request failed because it depended on another request and that request failed.
es: Dependencia fallida. La solicitud falló porque dependía de otra solicitud y esa solicitud falló.

source: Too early. The server is unwilling to risk processing a request that might be replayed.
es: Demasiado pronto. El servidor no está dispuesto a arriesgarse a procesar una solicitud que podría repetirse.

# Se requiere actualización. El cliente debe cambiar a un protocolo diferente.
source: Upgrade required. The client should switch to a different protocol.
es: Se requiere actualización. El cliente debe cambiar a un protocolo diferente.

source: Precondition required. The origin server requires the request to be conditional.
es: Se requiere precondición. El servidor de origen requiere que la solicitud sea condicional.

source: Too many requests. The user has sent too many requests in a given amount of time.
es: Demasiadas solicitudes. El usuario ha enviado demasiadas solicitudes en un período de tiempo determinado.

source: Request header fields too large. The server is unwilling to process the request because its header fields are too large.
es: Los campos de encabezado de la solicitud son demasiado grandes. El servidor no está dispuesto a procesar la solicitud porque sus campos de encabezado son demasiado grandes.

source: Unavailable for legal reasons. The server is denying access to the resource as a consequence of a legal demand.
es: No disponible por razones legales. El servidor está negando el acceso al recurso como consecuencia de una demanda legal.

source: Internal Server Error. The server encountered an unexpected condition that prevented it from fulfilling the request.
es: Error interno del servidor. El servidor encontró una condición inesperada que le impidió cumplir con la solicitud.

source: Not Implemented. The server does not support the functionality required to fulfill the request.
es: No implementado. El servidor no admite la funcionalidad requerida para cumplir con la solicitud.

source: Bad Gateway. The server, while acting as a gateway or proxy, received an invalid response from the upstream server it accessed in attempting to fulfill the request.
es: Puerta de enlace incorrecta. El servidor, actuando como una puerta de enlace o proxy, recibió una respuesta inválida del servidor ascendente al que accedió al intentar cumplir con la solicitud.
hi: खराब गेटवे। सर्वर, एक गेटवे या प्रॉक्सी के रूप में कार्य करते हुए, उस अपस्ट्रीम सर्वर से एक अमान्य प्रतिक्रिया प्राप्त की जिसे वह अनुरोध को पूरा करने के प्रयास में पहुँचा।
nl: Bad Gateway. De server, die fungeert als gateway of proxy, ontving een ongeldige reactie van de upstream-server die hij benaderde bij het proberen het verzoek te vervullen.

source: Service Unavailable. The server is currently unable to handle the request due to temporary overloading or maintenance of the server.
es: Servicio no disponible. El servidor no puede procesar la solicitud actualmente debido a una sobrecarga temporal o al mantenimiento del servidor.
hi: सेवा अनुपलब्ध। सर्वर वर्तमान में अस्थायी ओवरलोडिंग या सर्वर के रखरखाव के कारण अनुरोध को संभालने में असमर्थ है।
nl: Service niet beschikbaar. De server is momenteel niet in staat om het verzoek te verwerken vanwege tijdelijke overbelasting of onderhoud van de server.

source: Gateway Timeout. The server, while acting as a gateway or proxy, did not receive a timely response from the upstream server it accessed in attempting to fulfill the request.
es: Tiempo de espera de la puerta de enlace agotado. El servidor, actuando como una puerta de enlace o proxy, no recibió una respuesta oportuna del servidor ascendente al que accedió al intentar cumplir con la solicitud.
hi: गेटवे टाइमआउट। सर्वर, एक गेटवे या प्रॉक्सी के रूप में कार्य करते हुए, उस अपस्ट्रीम सर्वर से समय पर प्रतिक्रिया प्राप्त करने में विफल रहा जिसे वह अनुरोध को पूरा करने के प्रयास में पहुँचा।
nl: Gateway-time-out. De server, die fungeert als gateway of proxy, ontving niet tijdig een reactie van de upstream-server die hij benaderde bij het proberen het verzoek te vervullen.

source: HTTP Version Not Supported. The server does not support the HTTP protocol version used in the request.
es: Versión de HTTP no soportada. El servidor no admite la versión del protocolo HTTP utilizada en la solicitud.
hi: HTTP संस्करण समर्थित नहीं है। सर्वर उस HTTP प्रोटोकॉल संस्करण का समर्थन नहीं करता है जो अनुरोध में उपयोग किया गया था।
nl: HTTP-versie niet ondersteund. De server ondersteunt de HTTP-protocolversie die in het verzoek is gebruikt niet.

source: Variant Also Negotiates. Transparent content negotiation for the request results in a circular reference.
es: La variante también negocia. La negociación de contenido transparente para la solicitud da lugar a una referencia circular.
hi: वैरिएंट भी बातचीत करता है। अनुरोध के लिए पारदर्शी सामग्री वार्ता का परिणाम एक परिपत्र संदर्भ में होता है।
nl: Variant onderhandelt ook. Transparante inhoudsonderhandeling voor het verzoek resulteert in een cirkelverwijzing.

source: Insufficient Storage. The server is unable to store the representation needed to complete the request.
es: Almacenamiento insuficiente. El servidor no puede almacenar la representación necesaria para completar la solicitud.
hi: अपर्याप्त भंडारण। सर्वर उस प्रतिनिधित्व को संग्रहीत करने में असमर्थ है जिसकी अनुरोध को पूरा करने के लिए आवश्यकता होती है।
nl: Onvoldoende opslag. De server kan de representatie die nodig is om het verzoek te voltooien, niet opslaan.

source: Loop Detected. The server detected an infinite loop while processing the request.
es: Bucle detectado. El servidor detectó un bucle infinito al procesar la solicitud.
hi: लूप का पता चला। सर्वर ने अनुरोध को संसाधित करते समय एक अनंत लूप का पता लगाया।
nl: Lus gedetecteerd. De server detecteerde een oneindige lus tijdens het verwerken van het verzoek.

source: Not Extended. Further extensions to the request are required for the server to fulfill it.
es: No extendido. Se requieren más extensiones para la solicitud para que el servidor pueda cumplirla.
hi: विस्तारित नहीं। सर्वर को अनुरोध को पूरा करने के लिए आगे के एक्सटेंशन की आवश्यकता होती है।
nl: Niet uitgebreid. Verdere uitbreidingen van het verzoek zijn vereist voor de server om het te vervullen.
